{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}, "outputs": {"log_prob": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}, "actions": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}, "values": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/model_41/tf.math.divide_13/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.subtract_40/Sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/log_prob/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_41/tf.reshape_26/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.reshape_26/Reshape", "op": "Reshape", "input": ["input", "PartitionedCall/model_41/tf.reshape_26/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_41/tf.__operators__.add_78/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_41/tf.reshape_26/Reshape", "unknown", "unknown_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.__operators__.add_79/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_41/tf.reshape_26/Reshape", "unknown_7", "unknown_10"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.tanh_52/Tanh", "op": "Tanh", "input": ["PartitionedCall/model_41/tf.__operators__.add_78/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.tanh_53/Tanh", "op": "Tanh", "input": ["PartitionedCall/model_41/tf.__operators__.add_79/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.__operators__.add_80/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_41/tf.math.tanh_52/Tanh", "unknown_2", "unknown_4"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.__operators__.add_81/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_41/tf.math.tanh_53/Tanh", "unknown_12", "unknown_14"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.tanh_54/Tanh", "op": "Tanh", "input": ["PartitionedCall/model_41/tf.__operators__.add_80/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.tanh_55/Tanh", "op": "Tanh", "input": ["PartitionedCall/model_41/tf.__operators__.add_81/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.__operators__.add_83/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_41/tf.math.tanh_54/Tanh", "unknown_5", "unknown_8"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/values/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_41/tf.math.tanh_55/Tanh", "unknown_18", "unknown_21"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_41/tf.__operators__.add_83/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.subtract_39/Sub", "op": "SquaredDifference", "input": ["PartitionedCall/model_41/tf.__operators__.add_83/AddV2", "PartitionedCall/model_41/tf.__operators__.add_83/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["PartitionedCall/model_41/values/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.negative_13/Neg", "op": "Neg", "input": ["PartitionedCall/model_41/tf.math.subtract_39/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.divide_13/truediv", "op": "Mul", "input": ["PartitionedCall/model_41/tf.math.negative_13/Neg", "ConstantFolding/PartitionedCall/model_41/tf.math.divide_13/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/tf.math.subtract_41/Sub", "op": "Sub", "input": ["PartitionedCall/model_41/tf.math.divide_13/truediv", "PartitionedCall/model_41/tf.math.subtract_40/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_41/log_prob/Sum", "op": "Sum", "input": ["PartitionedCall/model_41/tf.math.subtract_41/Sub", "PartitionedCall/model_41/log_prob/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/model_41/log_prob/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [8, 64], "dtype": "float32"}, {"name": "unknown_1", "shape": [64], "dtype": "float32"}, {"name": "unknown_2", "shape": [64, 64], "dtype": "float32"}, {"name": "unknown_4", "shape": [64], "dtype": "float32"}, {"name": "unknown_5", "shape": [64, 2], "dtype": "float32"}, {"name": "unknown_8", "shape": [2], "dtype": "float32"}, {"name": "ConstantFolding/PartitionedCall/model_41/tf.math.divide_13/truediv_recip", "shape": [1, 2], "dtype": "float32"}, {"name": "PartitionedCall/model_41/tf.math.subtract_40/Sub", "shape": [1, 2], "dtype": "float32"}, {"name": "PartitionedCall/model_41/log_prob/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_41/tf.reshape_26/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "unknown_7", "shape": [8, 64], "dtype": "float32"}, {"name": "unknown_10", "shape": [64], "dtype": "float32"}, {"name": "unknown_12", "shape": [64, 64], "dtype": "float32"}, {"name": "unknown_14", "shape": [64], "dtype": "float32"}, {"name": "unknown_18", "shape": [64, 1], "dtype": "float32"}, {"name": "unknown_21", "shape": [1], "dtype": "float32"}]}]}