{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_12", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 8], "dtype": "float32", "sparse": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense1_policy", "trainable": true, "dtype": "float32", "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense1_policy", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense1_value", "trainable": true, "dtype": "float32", "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense1_value", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense2_policy", "trainable": true, "dtype": "float32", "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense2_policy", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense1_policy", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense2_value", "trainable": true, "dtype": "float32", "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense2_value", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense1_value", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "action_output", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "action_output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense2_policy", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "value_output", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "value_output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense2_value", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["action_output", 0, 0], ["value_output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "action_output/kernel", "shape": [64, 2], "dtype": "float32"}, {"name": "action_output/bias", "shape": [2], "dtype": "float32"}, {"name": "dense1_policy/kernel", "shape": [8, 64], "dtype": "float32"}, {"name": "dense1_policy/bias", "shape": [64], "dtype": "float32"}, {"name": "dense1_value/kernel", "shape": [8, 64], "dtype": "float32"}, {"name": "dense1_value/bias", "shape": [64], "dtype": "float32"}, {"name": "dense2_policy/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense2_policy/bias", "shape": [64], "dtype": "float32"}, {"name": "dense2_value/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense2_value/bias", "shape": [64], "dtype": "float32"}, {"name": "value_output/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "value_output/bias", "shape": [1], "dtype": "float32"}]}]}